package com.github.futa.config;

import com.google.common.collect.Lists;

import java.util.ArrayList;

public class ShopConfig {
    public boolean enabled = false;
    public boolean whilePlayerConnected = false;
    public boolean whisper = true;
    public long delaySeconds = 600L;
    public boolean randomOrder = true;
    public boolean appendRandom = true;
    public final ArrayList<String> messages = Lists.newArrayList(
            "出附魔金 便宜出 群1055741131",
            "出满配风暴三重锤 便宜出 群1055741131",
            "全服服务最优质的平价商店 群1055741131",
            "速来 群1055741131 抽奖 风暴三重锤",
            "rr商店：只玩平价！进群捡漏1055741131",
            "稀有物资大本营，价格亲民不坑人！rr商店群：1055741131",
            "告别‘奸商’！rr平价稀有商店，群1055741131良心到家！",
            "群1055741131 满配重锤，不买你会后悔，买了我会后悔（价格太低）！",
            "别人挖矿，我们挖价格！rr商店群1055741131",
            "rr商店——平价到让村民都摇头 群1055741131",
            "别人家找不到的附魔金，在rr商店竟然不贵？群1055741131速来！",
            "别人家找不到的稀奇货，在rr商店竟然不贵？群1055741131速来！",
            "大型宝藏群1055741131：附魔金多得像白菜，价格也像白菜！rr商店出品。",
            "大型宝藏群1055741131：稀有货多得像白菜，价格也像白菜！rr商店出品。",
            "在rr商店，稀有和平价终于不是情敌了！群1055741131见证奇迹。",
            "听说rr商店群1055741131在批发“稀有附魔金”？价格还很接地气！",
            "rr大型平价商店 附魔金，白菜价！速进群：1055741131",
            "别人没有的，rr有！还不贵！群1055741131 ",
            "别人没有的附魔金苹果，rr有！还不贵！群1055741131 ",
            "批发价买重锤！rr商店群1055741131",
            "附魔金苹果？白菜价出！速加群：1055741131",
            "金苹果附魔了，价格没附魔！rr商店 1055741131",
            "便宜附魔金，rr商店管够！群1055741131",
            "抢！附魔金骨折价！rr群1055741131",
            "附魔金苹价超低！群1055741131",
            "批发价买附魔金！rr商店群1055741131",
            "附魔金苹果清仓价！rr商店群1055741131",
            "rr商店群1055741131 附魔金苹果甩卖",
            "rr商店群1055741131 附魔金苹果低价处理",
            "rr商店：重锤附魔金便宜到家！群1055741131",
            "大型稀有平价店，群1055741131，别问为啥便宜，问就是良心。",
            "村民看了都流泪！rr大型平价商店，稀有货真价不黑！速加群1055741131",
            "rr商店-大型稀有平价商店 群1055741131 童叟无欺"
    );


}
